import { IFileStorage } from "../../interfaces/interfaces";

export const initialFileStorage: IFileStorage[] = [
    {
        id: "0",
        filename: "Шаблон приказа о введении в действие ЛНД.docx",
        title: "Шаблон 1. Приказ о введении в действие ЛНД Компании",
        create_date_time: "10.09.2022 11:44",
        modify_date_time: "10.09.2022 11:44",
        library: "Шаблоны документов",
        owner: 4,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 20.01.2022г. 111-П"
        },
    },
    {
        id: "1",
        filename: "Шаблон об отмене ЛНД.docx",
        title: "Шаблон 2. Приказ об отмене ЛНД",
        create_date_time: "11.09.2022 14:52",
        modify_date_time: "11.09.2022 14:52",
        library: "Шаблоны документов",
        owner: 8,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 20.01.2022г. 111-П"
        },
    },
    {
        id: "2",
        filename: "шаблон ДИ.docx",
        title: "Шаблон 3. Шаблон оформления должностной инструкции",
        create_date_time: "11.09.2022 14:55",
        modify_date_time: "11.09.2022 14:55",
        library: "Шаблоны документов",
        owner: 13,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 24.01.2022г. 114-П"
        },
    },
    {
        id: "3",
        filename: "Шаблон ЛНД.docx",
        title: "Шаблон 4. Шаблон ЛНД",
        create_date_time: "12.09.2022 11:23",
        modify_date_time: "12.09.2022 11:23",
        library: "Шаблоны документов",
        owner: 11,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 14.01.2022г. 109-П"
        },
    },
    {
        id: "4",
        filename: "Шаблон положения о СП.docx",
        title: "Шаблон 5. Шаблон оформления положения о структурном подразделении",
        create_date_time: "14.09.2022 14:02",
        modify_date_time: "14.09.2022 14:02",
        library: "Шаблоны документов",
        owner: 13,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 12.01.2022г. 107-П"
        },
    },
    {
        id: "5",
        filename: "Шаблон дополнения к ДИ.docx",
        title: "Шаблон 6. Шаблон оформления дополнения к должностной инструкции",
        create_date_time: "12.09.2022 11:25",
        modify_date_time: "12.09.2022 11:25",
        library: "Шаблоны документов",
        owner: 13,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 14.01.2022г. 109-П"
        },
    },
    {
        id: "6",
        filename: "Шаблон РИ.docx",
        title: "Шаблон 7. Шаблон оформления рабочей инструкции",
        create_date_time: "11.09.2022 14:59",
        modify_date_time: "11.09.2022 14:59",
        library: "Шаблоны документов",
        owner: 13,
        meta: {
            "Направление": "Нормативное регулирование",
            "Примечание": "Утвержден приказом от 14.01.2022г. 109-П"
        },
    },
    {
        id: "7",
        filename: "Шаблон права на ПО.docx",
        title: "Договор передачи исключительных лицензий на использование программ для ЭВМ",
        create_date_time: "12.09.2022 14:40",
        modify_date_time: "12.09.2022 14:40",
        library: "Стандартные формы договоров",
        owner: 14,
        meta: {
            "Номер и дата приказа": "0101Е от 02.02.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "8",
        filename: "Договор на оказание агентских и иных услуг.docx",
        title: "Договор на оказание агентских и иных услуг",
        create_date_time: "11.09.2022 11:41",
        modify_date_time: "11.09.2022 11:41",
        library: "Стандартные формы договоров",
        owner: 1,
        meta: {
            "Номер и дата приказа": "0102Е от 01.02.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "9",
        filename: "Договор купки-продажи имущества.docx",
        title: "Договор купки-продажи имущества",
        create_date_time: "14.09.2022 14:44",
        modify_date_time: "14.09.2022 14:44",
        library: "Стандартные формы договоров",
        owner: 1,
        meta: {
            "Номер и дата приказа": "0113Е от 01.04.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "10",
        filename: "Договор возмездного оказания ИТ-Услуг.docx",
        title: "Договор возмездного оказания ИТ-Услуг",
        create_date_time: "15.09.2022 14:44",
        modify_date_time: "15.09.2022 14:44",
        library: "Стандартные формы договоров",
        owner: 2,
        meta: {
            "Номер и дата приказа": "0115Е от 01.06.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "11",
        filename: "Договор купли-продажи акций.docx",
        title: "Договор купли-продажи акций",
        create_date_time: "16.09.2022 08:12",
        modify_date_time: "16.09.2022 08:12",
        library: "Стандартные формы договоров",
        owner: 4,
        meta: {
            "Номер и дата приказа": "0105Е от 12.05.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "12",
        filename: "Договор на оказание оинформационных услуг.docx",
        title: "Договор на оказание оинформационных услуг",
        create_date_time: "17.09.2022 09:16",
        modify_date_time: "17.09.2022 09:16",
        library: "Стандартные формы договоров",
        owner: 6,
        meta: {
            "Номер и дата приказа": "0107Е от 16.05.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "13",
        filename: "Договор на выполнение работ по разработке ПО.docx",
        title: "Договор на выполнение работ по разработке программного обеспечения",
        create_date_time: "11.09.2022 08:17",
        modify_date_time: "11.09.2022 08:17",
        library: "Стандартные формы договоров",
        owner: 11,
        meta: {
            "Номер и дата приказа": "0103Е от 12.02.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "14",
        filename: "Агентский договор на реализацию невостребованных полезностей.docx",
        title: "Агентский договор на реализацию невостребованных полезностей",
        create_date_time: "12.09.2022 08:17",
        modify_date_time: "12.09.2022 08:17",
        library: "Стандартные формы договоров",
        owner: 11,
        meta: {
            "Номер и дата приказа": "0106Е от 06.04.2022",
            "Область действия": "Компания"
        },
    },
    {
        id: "15",
        filename: "Матрица рисков в области ИТ.docx",
        title: "Матрица рисков в области ИТ",
        create_date_time: "12.09.2022 08:17",
        modify_date_time: "12.09.2022 08:17",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0106Е от 06.04.2022",
            "Комментарии": ""
        },
    },
    {
        id: "16",
        filename: "Матрица рисков в области ИБ.docx",
        title: "Матрица рисков в области ИБ",
        create_date_time: "12.09.2022 08:18",
        modify_date_time: "12.09.2022 08:18",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0107Е от 07.04.2022",
            "Комментарии": ""
        },
    },
    {
        id: "17",
        filename: "Матрица рисков в области налогообложения.docx",
        title: "Матрица рисков в области налогообложения",
        create_date_time: "14.09.2022 09:17",
        modify_date_time: "14.09.2022 09:17",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0108Е от 08.04.2022",
            "Комментарии": ""
        },
    },
    {
        id: "18",
        filename: "Матрица рисков в области капитального строительства.docx",
        title: "Матрица рисков в области капитального строительства",
        create_date_time: "16.09.2022 14:17",
        modify_date_time: "16.09.2022 14:17",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0109Е от 09.04.2022",
            "Комментарии": ""
        },
    },
    {
        id: "19",
        filename: "Матрица рисков в области МТР.docx",
        title: "Матрица рисков в области МТР",
        create_date_time: "17.09.2022 16:17",
        modify_date_time: "17.09.2022 16:17",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0110Е от 10.04.2022",
            "Комментарии": ""
        },
    },
    {
        id: "20",
        filename: "Матрица рисков в области ЛФО.docx",
        title: "Матрица рисков в области ЛФО",
        create_date_time: "18.09.2022 08:11",
        modify_date_time: "18.09.2022 08:11",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0111Е от 11.04.2022",
            "Комментарии": ""
        },
    },
    {
        id: "21",
        filename: "Матрица рисков в области управления корпортивной собственностью.docx",
        title: "Матрица рисков в области управления корпортивной собственностью",
        create_date_time: "19.09.2022 11:07",
        modify_date_time: "19.09.2022 11:07",
        library: "Матрицы рисков",
        owner: 15,
        meta: {
            "Номер и дата приказа": "0112Е от 12.04.2022",
            "Комментарии": ""
        },
    },
]
    

